###### Visualización de Datos - Práctica 1

# Preparación de los datos

In [68]:
#Imports
import pandas as pd
import numpy as np

In [86]:
#Carga datasets
salaries_path = '../data/raw/salaries.csv'
cost_of_living_path = '../data/raw/cost_of_living.csv'
iso_country_codes_path = '../data/iso_country_codes.csv'

df_salaries = pd.read_csv(salaries_path)
df_cost_of_living = pd.read_csv(cost_of_living_path, delimiter=';')
df_iso_country_codes = pd.read_csv(iso_country_codes_path, delimiter=';')

In [87]:
df_salaries.sample(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
17075,2024,SE,FT,Systems Engineer,163000,USD,163000,US,0,US,M
73446,2021,SE,FT,Data Scientist,240000,USD,240000,US,0,US,L
69429,2023,EX,FT,Data Analyst,160000,USD,160000,US,100,US,M

In [88]:
df_cost_of_living.sample(3)

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
70,71,Ethiopia,"43,1","15,1","29,8","42,4","19,5","10,4"
86,87,Myanmar,"38,6","15,3","27,5","31,2","16,1",16
128,129,Paraguay,"27,6","10,5","19,5","24,9","19,1","28,1"

In [89]:
df_iso_country_codes.sample(3)

                Country Alpha-2 code Alpha-3 code  Numeric
25              Bolivia           BO          BOL       68
170            Paraguay           PY          PRY      600
61   Dominican Republic           DO          DOM      214

Para poder combinar la información de los dataframes y pensando en mostrar los nombres enteros de los países en las visualizaciones sustituimos los códigos de las columnas "employee_residence' y 'company_location' por el nombre del país completo:

In [90]:
# Diccionario código - nombre país
iso_mapping = df_iso_country_codes.set_index('Alpha-2 code')['Country'].to_dict()

# Cambiar los códigos por los nombres
df_salaries['employee_residence'] = df_salaries['employee_residence'].map(iso_mapping)
df_salaries['company_location'] = df_salaries['company_location'].map(iso_mapping)


df_salaries.sample(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
48897,2024,SE,FT,Data Scientist,168000,USD,168000,United States,0,United States,M
6661,2024,SE,FT,Data Scientist,196900,USD,196900,United States,0,United States,M
34194,2024,MI,FT,Software Engineer,92030,USD,92030,United States,0,United States,M
3419,2024,SE,FT,Business Intelligence Engineer,45000,GBP,56250,United Kingdom,0,United Kingdom,M
1526,2024,MI,FT,Software Engineer,95300,USD,95300,United States,0,United States,M
17607,2024,SE,FT,Full Stack Engineer,265000,USD,265000,United States,100,United States,M
8135,2024,SE,FT,Machine Learning Engineer,246400,USD,246400,United States,0,United States,M
27244,2024,EN,FT,Data Engineer,33982,GBP,42477,United Kingdom,0,United Kingdom,M
53706,2024,SE,FT,Data Engineer,105200,USD,105200,United States,0,United States,M
4276,2024,SE,FT,Data Engineer,98500,USD,98500,United States,0,United States,M

Combinamos los datos para crear un único archivo con el que crearemos las visualizaciones:

In [93]:
df_salaries = df_salaries.merge(df_cost_of_living, left_on="employee_residence", right_on="Country", how="left")

In [94]:
df_salaries.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 73719 entries, 0 to 73718
Data columns (total 19 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   work_year                       73719 non-null  int64
 1   experience_level                73719 non-null  object
 2   employment_type                 73719 non-null  object
 3   job_title                       73719 non-null  object
 4   salary                          73719 non-null  int64
 5   salary_currency                 73719 non-null  object
 6   salary_in_usd                   73719 non-null  int64
 7   employee_residence              73719 non-null  object
 8   remote_ratio                    73719 non-null  int64
 9   company_location                73719 non-null  object
 10  company_size                    73719 non-null  object
 11  Rank                            73715 non-null  float64
 12  Country                         73715 non-null  object
 13  Cost of Living Index            73715 non-null  object
 14  Rent Index                      73715 non-null  object
 15  Cost of Living Plus Rent Index  73715 non-null  object
 16  Groceries Index                 73715 non-null  object
 17  Restaurant Price Index          73715 non-null  object
 18  Local Purchasing Power Index    73715 non-null  object
dtypes: float64(1), int64(4), object(14)
memory usage: 11.2+ MB

In [97]:
# Eliminamos las columnas que ya no queremos
df_salaries = df_salaries.drop(columns=['Rank','Country'])

# Renombramos las que necesitamos para el análisis
df_salaries.columns = df_salaries.columns.str.lower().str.replace(' ', '_')

# Eliminamos los 4 registros con cost_of_living_index nulo, de países 
df_salaries = df_salaries[df_salaries['cost_of_living_index'].notna()]

In [98]:
df_salaries

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,cost_of_living_index,rent_index,cost_of_living_plus_rent_index,groceries_index,restaurant_price_index,local_purchasing_power_index
0,2025,MI,FT,Machine Learning Engineer,400000,USD,400000,United States,0,United States,M,"72,9","44,7","59,5","74,2","68,4","120,9"
1,2025,MI,FT,Machine Learning Engineer,150000,USD,150000,United States,0,United States,M,"72,9","44,7","59,5","74,2","68,4","120,9"
2,2025,MI,FT,Machine Learning Engineer,207000,USD,207000,United States,0,United States,M,"72,9","44,7","59,5","74,2","68,4","120,9"
3,2025,MI,FT,Machine Learning Engineer,138000,USD,138000,United States,0,United States,M,"72,9","44,7","59,5","74,2","68,4","120,9"
4,2025,SE,FT,Research Engineer,251000,USD,251000,United States,0,United States,M,"72,9","44,7","59,5","74,2","68,4","120,9"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73714,2020,SE,FT,Data Scientist,412000,USD,412000,United States,100,United States,L,"72,9","44,7","59,5","74,2","68,4","120,9"
73715,2021,MI,FT,Principal Data Scientist,151000,USD,151000,United States,100,United States,L,"72,9","44,7","59,5","74,2","68,4","120,9"
73716,2020,EN,FT,Data Scientist,105000,USD,105000,United States,100,United States,S,"72,9","44,7","59,5","74,2","68,4","120,9"
73717,2020,EN,CT,Business Data Analyst,100000,USD,100000,United States,100,United States,L,"72,9","44,7","59,5","74,2","68,4","120,9"
73718,2021,SE,FT,Data Scientist,7000000,INR,94665,India,50,India,L,"22,2","6,2","14,6","23,5","15,6","60,7"

In [103]:
# Reemplazar las comas por puntos en las columnas relevantes
df_salaries['cost_of_living_index'] = df_salaries['cost_of_living_index'].str.replace(',', '.')

# Convertir la columna a float
df_salaries['cost_of_living_index'] = df_salaries['cost_of_living_index'].astype(float)

# Repetir para las otras columnas con el mismo problema
df_salaries['rent_index'] = df_salaries['rent_index'].str.replace(',', '.').astype(float)
df_salaries['cost_of_living_plus_rent_index'] = df_salaries['cost_of_living_plus_rent_index'].str.replace(',', '.').astype(float)
df_salaries['groceries_index'] = df_salaries['groceries_index'].str.replace(',', '.').astype(float)
df_salaries['restaurant_price_index'] = df_salaries['restaurant_price_index'].str.replace(',', '.').astype(float)
df_salaries['local_purchasing_power_index'] = df_salaries['local_purchasing_power_index'].str.replace(',', '.').astype(float)

In [106]:
# Añadir la relación salario/costo de vida
df_salaries['salario_costo_vida'] = df_salaries['salary_in_usd'] / df_salaries['cost_of_living_index'].astype(float)

# Añadir el salario ajustado por poder adquisitivo
df_salaries['salario_ajustado'] = df_salaries['salary_in_usd'] * (df_salaries['local_purchasing_power_index'].astype(float) / 100)

# Agrupar por país y calcular la media de las métricas
df_pais_avg = df_salaries.groupby('employee_residence')[['salario_costo_vida', 'salario_ajustado']].mean().reset_index()

# Ver las primeras filas del nuevo dataset
df_pais_avg.head(25)

        employee_residence  salario_costo_vida  salario_ajustado
0                  Algeria         3389.830508      25400.000000
1                Argentina         2402.263891      23908.291149
2                  Armenia         1177.544041      14590.477200
3                Australia         1754.356284     119543.240700
4                  Austria          948.092622      53452.703560
5                  Belgium         2044.271709     116811.729706
6                  Bermuda          748.502994      84300.000000
7                  Bolivia         2650.176678      24225.000000
8   Bosnia and Herzegovina         2161.383285      35325.000000
9                   Brazil         1843.983229      19537.371113
10                Bulgaria         2196.375969      44709.868500
11                  Canada         1958.817060     111607.911392
12                   Chile         1501.199875      21802.826500
13                   China         3677.536657      75869.420000
14                Colombia         2161.095732      18582.397765
15              Costa Rica          646.766169      12826.666667
16                 Croatia         1543.931237      41998.017500
17                  Cyprus          814.320968      27619.650000
18          Czech Republic         3899.583905     122998.335778
19                 Denmark          815.992021      63387.565800
20      Dominican Republic         2820.512821      25850.000000
21                 Ecuador          992.063492      12133.333333
22                   Egypt         4566.110293      20196.819048
23             El Salvador         1021.897810       9324.000000
24                 Estonia          829.090909      30319.854545

In [121]:
# Filtrar por los años 2024 y 2025
df_salaries_filtered_years = df_salaries[df_salaries['work_year'].isin([2024, 2025])]

# Contar los registros por país de residencia en los años 2024 y 2025
country_counts = df_salaries_filtered_years['employee_residence'].value_counts()

# Mostrar los países con su respectivo número de registros para los años 2024 y 2025
country_counts.head()

United States     57462
Canada             2295
United Kingdom     1657
Australia           213
Germany             154
Lithuania           138
France              136
Netherlands         122
Austria             103
Slovakia             74
India                69
Spain                66
Ireland              59
Poland               56
South Africa         56
Brazil               42
Mexico               42
Finland              41
Egypt                40
Argentina            38
Switzerland          31
Philippines          30
New Zealand          29
Latvia               28
Italy                21
Colombia             18
Singapore            16
Turkey               16
Portugal             15
Chile                14
Israel               13
Malta                12
Lebanon              12
Belgium              11
Cyprus               10
Japan                10
Ukraine               9
Armenia               8
Greece                7
Czech Republic        7
Sweden                7
South Korea           6
Peru                  6
Puerto Rico           4
Kenya                 4
Bulgaria              3
Luxembourg            3
Croatia               3
Serbia                2
Venezuela             2
Name: employee_residence, dtype: int64

In [122]:
# Definir el umbral de registros mínimos
umbral = 10

# Filtrar los países con al menos 'umbral' registros en los años 2024 y 2025
countries_with_enough_data = country_counts[country_counts >= umbral].index

# Filtrar el dataframe original para quedarse solo con estos países y años
df_salaries_filtered = df_salaries_filtered_years[df_salaries_filtered_years['employee_residence'].isin(countries_with_enough_data)]

df_salaries_filtered

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,cost_of_living_index,rent_index,cost_of_living_plus_rent_index,groceries_index,restaurant_price_index,local_purchasing_power_index,salario_costo_vida,salario_ajustado
0,2025,MI,FT,Machine Learning Engineer,400000,USD,400000,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,5486.968450,483600.000
1,2025,MI,FT,Machine Learning Engineer,150000,USD,150000,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,2057.613169,181350.000
2,2025,MI,FT,Machine Learning Engineer,207000,USD,207000,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,2839.506173,250263.000
3,2025,MI,FT,Machine Learning Engineer,138000,USD,138000,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,1893.004115,166842.000
4,2025,SE,FT,Research Engineer,251000,USD,251000,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,3443.072702,303459.000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
63258,2024,SE,FT,Data Analyst,170000,USD,170000,United States,100,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,2331.961591,205530.000
63259,2024,SE,FT,Data Scientist,195500,USD,195500,United States,100,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,2681.755830,236359.500
63260,2024,SE,FT,Data Scientist,141300,USD,141300,United States,100,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,1938.271605,170831.700
63261,2024,SE,FT,Data Engineer,139810,USD,139810,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,1917.832647,169030.290
63262,2024,SE,FT,Data Engineer,95325,USD,95325,United States,0,United States,M,72.9,44.7,59.5,74.2,68.4,120.9,1307.613169,115247.925